Tekla Open API Reference for Tekla Structures 2025
LineSegment Constructor
 Instantiates a line segment with both the starting point and the end point zeroed.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment()
Public Sub New
See Also
Reference
LineSegment Class
LineSegment Overload
Tekla.Structures.Geometry3d Namespace